Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/FM33HT0xxA_DEMO/Drivers/FM33HT0xxA_FL_Driver/Inc/fm33ht0xxa_fl_gpio.h
#define    GPIO_EXTIEDSG_Pos                                      (0U)
#define    GPIO_EXTIEDSG_Msk                                      (0x3U << GPIO_EXTIEDSG_Pos)
#define    GPIO_EXTIEDSG                                          GPIO_EXTIEDSG_Msk

#define    GPIO_EXTIDFAB_DFA_Pos                                  (0U)
#define    GPIO_EXTIDFAB_DFA_Msk                                  (0xffffU << GPIO_EXTIDFAB_DFA_Pos)
#define    GPIO_EXTIDFAB_DFA                                      GPIO_EXTIDFAB_DFA_Msk

#define    GPIO_EXTIDFAB_DFB_Pos                                  (16U)
#define    GPIO_EXTIDFAB_DFB_Msk                                  (0xffffU << GPIO_EXTIDFAB_DFB_Pos)
#define    GPIO_EXTIDFAB_DFB                                      GPIO_EXTIDFAB_DFB_Msk

#define    GPIO_EXTIDFCD_DFC_Pos                                  (0U)
#define    GPIO_EXTIDFCD_DFC_Msk                                  (0xffffU << GPIO_EXTIDFCD_DFC_Pos)
#define    GPIO_EXTIDFCD_DFC                                      GPIO_EXTIDFCD_DFC_Msk

#define    GPIO_EXTIDFCD_DFD_Pos                                  (16U)
#define    GPIO_EXTIDFCD_DFD_Msk                                  (0xffffU << GPIO_EXTIDFCD_DFD_Pos)
#define    GPIO_EXTIDFCD_DFD                                      GPIO_EXTIDFCD_DFD_Msk

#define    GPIO_EXTIDFEF_DFE_Pos                                  (0U)
#define    GPIO_EXTIDFEF_DFE_Msk                                  (0xffffU << GPIO_EXTIDFEF_DFE_Pos)
#define    GPIO_EXTIDFEF_DFE                                      GPIO_EXTIDFEF_DFE_Msk

#define    GPIO_EXTIDFEF_DFF_Pos                                  (16U)
#define    GPIO_EXTIDFEF_DFF_Msk                                  (0xffffU << GPIO_EXTIDFEF_DFF_Pos)
#define    GPIO_EXTIDFEF_DFF                                      GPIO_EXTIDFEF_DFF_Msk

#define    GPIO_EXTIDFGH_DFG_Pos                                  (0U)
#define    GPIO_EXTIDFGH_DFG_Msk                                  (0xffffU << GPIO_EXTIDFGH_DFG_Pos)
#define    GPIO_EXTIDFGH_DFG                                      GPIO_EXTIDFGH_DFG_Msk

#define    GPIO_EXTIDFGH_DFH_Pos                                  (16U)
#define    GPIO_EXTIDFGH_DFH_Msk                                  (0xffffU << GPIO_EXTIDFGH_DFH_Pos)
#define    GPIO_EXTIDFGH_DFH                                      GPIO_EXTIDFGH_DFH_Msk

#define    GPIO_EXTIISRAB_ISRA_Pos                                (0U)
#define    GPIO_EXTIISRAB_ISRA_Msk                                (0xffffU << GPIO_EXTIISRAB_ISRA_Pos)
#define    GPIO_EXTIISRAB_ISRA                                    GPIO_EXTIISRAB_ISRA_Msk

#define    GPIO_EXTIISRAB_ISRB_Pos                                (16U)
#define    GPIO_EXTIISRAB_ISRB_Msk                                (0xffffU << GPIO_EXTIISRAB_ISRB_Pos)
#define    GPIO_EXTIISRAB_ISRB                                    GPIO_EXTIISRAB_ISRB_Msk

#define    GPIO_EXTIISRCD_ISRC_Pos                                (0U)
#define    GPIO_EXTIISRCD_ISRC_Msk                                (0xffffU << GPIO_EXTIISRCD_ISRC_Pos)
#define    GPIO_EXTIISRCD_ISRC                                    GPIO_EXTIISRCD_ISRC_Msk

#define    GPIO_EXTIISRCD_ISRD_Pos                                (16U)
#define    GPIO_EXTIISRCD_ISRD_Msk                                (0xffffU << GPIO_EXTIISRCD_ISRD_Pos)
#define    GPIO_EXTIISRCD_ISRD                                    GPIO_EXTIISRCD_ISRD_Msk

#define    GPIO_EXTIISREF_ISRE_Pos                                (0U)
#define    GPIO_EXTIISREF_ISRE_Msk                                (0xffffU << GPIO_EXTIISREF_ISRE_Pos)
#define    GPIO_EXTIISREF_ISRE                                    GPIO_EXTIISREF_ISRE_Msk

#define    GPIO_EXTIISREF_ISRF_Pos                                (16U)
#define    GPIO_EXTIISREF_ISRF_Msk                                (0xffffU << GPIO_EXTIISREF_ISRF_Pos)
#define    GPIO_EXTIISREF_ISRF                                    GPIO_EXTIISREF_ISRF_Msk

#define    GPIO_EXTIISRGH_ISRG_Pos                                (0U)
#define    GPIO_EXTIISRGH_ISRG_Msk                                (0xffffU << GPIO_EXTIISRGH_ISRG_Pos)
#define    GPIO_EXTIISRGH_ISRG                                    GPIO_EXTIISRGH_ISRG_Msk

#define    GPIO_EXTIISRGH_ISRH_Pos                                (16U)
#define    GPIO_EXTIISRGH_ISRH_Msk                                (0xffffU << GPIO_EXTIISRGH_ISRH_Pos)
#define    GPIO_EXTIISRGH_ISRH                                    GPIO_EXTIISRGH_ISRH_Msk

#define    GPIO_EXTIDIAB_DIA_Pos                                  (0U)
#define    GPIO_EXTIDIAB_DIA_Msk                                  (0xffffU << GPIO_EXTIDIAB_DIA_Pos)
#define    GPIO_EXTIDIAB_DIA                                      GPIO_EXTIDIAB_DIA_Msk

#define    GPIO_EXTIDIAB_DIB_Pos                                  (16U)
#define    GPIO_EXTIDIAB_DIB_Msk                                  (0xffffU << GPIO_EXTIDIAB_DIB_Pos)
#define    GPIO_EXTIDIAB_DIB                                      GPIO_EXTIDIAB_DIB_Msk

#define    GPIO_EXTIDICD_DIC_Pos                                  (0U)
#define    GPIO_EXTIDICD_DIC_Msk                                  (0xffffU << GPIO_EXTIDICD_DIC_Pos)
#define    GPIO_EXTIDICD_DIC                                      GPIO_EXTIDICD_DIC_Msk

#define    GPIO_EXTIDICD_DID_Pos                                  (16U)
#define    GPIO_EXTIDICD_DID_Msk                                  (0xffffU << GPIO_EXTIDICD_DID_Pos)
#define    GPIO_EXTIDICD_DID                                      GPIO_EXTIDICD_DID_Msk

#define    GPIO_EXTIDIEF_DIE_Pos                                  (0U)
#define    GPIO_EXTIDIEF_DIE_Msk                                  (0xffffU << GPIO_EXTIDIEF_DIE_Pos)
#define    GPIO_EXTIDIEF_DIE                                      GPIO_EXTIDIEF_DIE_Msk

#define    GPIO_EXTIDIEF_DIF_Pos                                  (16U)
#define    GPIO_EXTIDIEF_DIF_Msk                                  (0xffffU << GPIO_EXTIDIEF_DIF_Pos)
#define    GPIO_EXTIDIEF_DIF                                      GPIO_EXTIDIEF_DIF_Msk

#define    GPIO_EXTIDIGH_DIG_Pos                                  (0U)
#define    GPIO_EXTIDIGH_DIG_Msk                                  (0xffffU << GPIO_EXTIDIGH_DIG_Pos)
#define    GPIO_EXTIDIGH_DIG                                      GPIO_EXTIDIGH_DIG_Msk

#define    GPIO_EXTIDIGH_DIH_Pos                                  (16U)
#define    GPIO_EXTIDIGH_DIH_Msk                                  (0xffffU << GPIO_EXTIDIGH_DIH_Pos)
#define    GPIO_EXTIDIGH_DIH                                      GPIO_EXTIDIGH_DIH_Msk

